service/catalog/doc/postman/export/collection/c3e5fff3-4659-4d08-b4cb-295c0d38c48c.json

{"info":{"_postman_id":"c3e5fff3-4659-4d08-b4cb-295c0d38c48c","name":"CountriesPortService","description":"\n","schema":"https://schema.getpostman.com/json/collection/v2.1.0/collection.json"},"item":[{"name":"getCountry","id":"b3e8cd2e-d39f-492d-b5aa-7f50b966417c","protocolProfileBehavior":{"disableBodyPruning":true},"request":{"method":"POST","header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\" xmlns:gs=\"http://www.baeldung.com/springsoap/gen\">\n    <soap:Body>\n        <gs:getCountryRequest>\n            <gs:name>Spain</gs:name>\n        </gs:getCountryRequest>\n    </soap:Body>\n</soap:Envelope>","options":{"raw":{"language":"xml"}}},"url":{"raw":"{{CountriesPortSoap11BaseUrl}}/ws","host":["{{CountriesPortSoap11BaseUrl}}"],"path":["ws"]}},"response":[{"id":"cf2cd2d8-b2b0-4abb-a8e5-c9ce82f153a6","name":"getCountry response","originalRequest":{"method":"POST","header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"body":{"mode":"raw","raw":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <error>The element or type could not be found undefined</error>\n  </soap:Body>\n</soap:Envelope>\n","options":{"raw":{"language":"xml"}}},"url":{"raw":"http://localhost:8080/ws","protocol":"http","host":["localhost"],"port":"8080","path":["ws"]}},"status":"OK","code":200,"_postman_previewlanguage":"xml","header":[{"key":"Content-Type","value":"text/xml; charset=utf-8"}],"cookie":[],"responseTime":null,"body":"<?xml version=\"1.0\" encoding=\"utf-8\"?>\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap:Body>\n    <error>The element or type could not be found undefined</error>\n  </soap:Body>\n</soap:Envelope>\n"}]}],"variable":[{"id":"9c7e05c2-2b4a-4ffe-b5ca-893519f5edc5","key":"CountriesPortSoap11BaseUrl","value":"http://localhost:8080","type":"any"}]}